/*
Приведение в булю на примере Boolean (value)
*/

/*
0, NaN, null, undefined, '', false
*/
// console.log(Boolean(NaN))

  /*
   Логическое И (оператор &&)
    запинается на лжи
    возвращает то, на чем запнулось или последний операнд
  */

// console.log(5 && 'hello' && 0 && 'mango');

/*
Логическое ИЛИ (оператор ||)
запинеается на правде
возвращает то, на чем запнулось или последний операнд
*/

// console.log(10 || NaN || null || 0);

/*
Логическое НЕ (оператор !)
делает инверсию правда > ложь и ложь > правда
*/

// console.log(!false);
// console.log(!0);
// console.log(!'qwe');
// console.log(!null);


